SPedt_!/src/InformationRegisters/ДанныеЗаказовСайт/ДанныеЗаказовСайт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеЗаказовСайт</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>БесплатнаяВыдача</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПредоплаченоУчастником</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НадбавкаЗаОбработку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АктуальнаяПерваяТочка</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </resources>
  <resources>
    <name>ПерваяТочка</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </resources>
  <resources>
    <name>ПунктВыдачи</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </resources>
  <resources>
    <name>Покупка</name>
    <type>
      <types>CatalogRef.Покупки</types>
    </type>
  </resources>
  <resources>
    <name>Организатор</name>
    <type>
      <types>CatalogRef.Организаторы</types>
    </type>
  </resources>
  <resources>
    <name>secureCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоКомпенсироаннаДоставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ФормированиеКоробки</types>
      <types>DocumentRef.ЗаказыДляТранзита</types>
      <types>DocumentRef.Приходная</types>
      <types>DocumentRef.ПоступлениеПристроя</types>
      <types>DocumentRef.РазборКоробки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>CatalogRef.Посылки</types>
      <types>CatalogRef.ЗаявкаНаДоставку</types>
      <types>CatalogRef.Коробки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SPedt_!/src/Documents/СинхронизацияПоступлений/СинхронизацияПоступлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СинхронизацияПоступлений</name>
  <registerRecords>AccumulationRegister.ЗаказыВПосылках</registerRecords>
  <registerRecords>InformationRegister.ДанныеЗаказовСайт</registerRecords>
  <registerRecords>AccumulationRegister.Обмен100СПрн_Ошибки</registerRecords>
  <registerRecords>AccumulationRegister.Транзит</registerRecords>
  <registerRecords>AccumulationRegister.НеВыгруженноНаСайт</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>Отправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокВПакете</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Данные</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DefinedType.Заказ100сп</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктВыдачиНаСтикере</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DefinedType.ПартияДляОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>Коробка</name>
      <type>
        <types>CatalogRef.СобранныеЗаказы</types>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Габарит</name>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтдельнымМестом</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПриема</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Негабарит</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КодТарифа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НетДанных</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>innerId</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>Ошибка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Сообщение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НадбавкаЗаОбработку</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПерваяТочка</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктВыдачи</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>CatalogRef.Покупки</types>
      </type>
    </attributes>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.Организаторы</types>
      </type>
    </attributes>
    <attributes>
      <name>secureCode</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БесплатнаяВыдача</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредоплаченоУчастником</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Обработано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеЗагруженСоставПосылки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеОплачен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзмененВПартии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>АктуальнаяПерваяТочка</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКомпенсироаннаДоставка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Накладные</name>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DefinedType.ПартияДляОбмена</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SPedt_!/src/CommonModules/ПроцедурыПриОбновлении/Module.bsl
Процедура СформироватьДвиженияРасходВыдачаТранзита(ДатаНачала) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыдачаТранзитаПокупки.Ссылка.Дата КАК Период,
		|	ВыдачаТранзитаПокупки.Покупка КАК Покупка,
		|	ВЫБОР
		|		КОГДА ВыдачаТранзитаПокупки.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВыдачаТранзита.НаНесколькоТочек)
		|			ТОГДА ВыдачаТранзитаПокупки.ТочкаНазначения
		|		ИНАЧЕ ВыдачаТранзитаПокупки.Ссылка.ТочкаНазначения
		|	КОНЕЦ КАК Участник,
		|	ВыдачаТранзитаПокупки.Габарит КАК Габарит,
		|	ВыдачаТранзитаПокупки.МестоХранения КАК МестоХранения,
		|	ЛОЖЬ КАК Списано,
		|	ВЫБОР
		|		КОГДА ВыдачаТранзитаПокупки.Ссылка.ТочкаНазначения.Код = ""0100""
		|			ТОГДА ВыдачаТранзитаПокупки.Количество
		|		ИНАЧЕ ВыдачаТранзитаПокупки.КоличествоМест
		|	КОНЕЦ КАК Количество,
		|	ВЫБОР
		|		КОГДА ВыдачаТранзитаПокупки.Ссылка.ОшибочныеЗаказы
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипРасхода.ОшибочныеЗаказы)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипРасхода.Транзит)
		|	КОНЕЦ КАК ТипРасхода,
		|	ВЫБОР
		|		КОГДА ВыдачаТранзитаПокупки.Ссылка.ОшибочныеЗаказы
		|			ТОГДА 0
		|		КОГДА ВыдачаТранзитаПокупки.Ссылка.ТочкаНазначения = &ЭтоКурьер
		|			ТОГДА ВыдачаТранзитаПокупки.СтоимостьХранения
		|		ИНАЧЕ ВыдачаТранзитаПокупки.СтоимостьИтого
		|	КОНЕЦ КАК Сумма,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ВыдачаТранзитаПокупки.Партия) = ТИП(Документ.ПоступлениеПристроя)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Пристрой,
		|	ВыдачаТранзитаПокупки.Партия КАК Партия,
		|	ВыдачаТранзитаПокупки.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Документ.ВыдачаТранзита.Покупки КАК ВыдачаТранзитаПокупки
		|ГДЕ
		|	ВыдачаТранзитаПокупки.Подбор
		|	И НЕ ВыдачаТранзитаПокупки.Ссылка.ПоОбмену
		|	И ВыдачаТранзитаПокупки.Ссылка.Дата >= &ДатаНачала
		|	И ВыдачаТранзитаПокупки.Ссылка.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.Период КАК Период,
		|	вт.Покупка КАК Покупка,
		|	вт.Участник КАК Участник,
		|	вт.Габарит КАК Габарит,
		|	вт.МестоХранения КАК МестоХранения,
		|	вт.Списано КАК Списано,
		|	вт.Количество КАК Количество,
		|	вт.ТипРасхода КАК ТипРасхода,
		|	вт.Сумма КАК Сумма,
		|	вт.Пристрой КАК Пристрой,
		|	вт.Партия КАК Партия,
		|	вт.Ссылка КАК Ссылка
		|ИЗ
		|	вт КАК вт
		|ИТОГИ ПО
		|	Ссылка";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ЭтоКурьер", Справочники.ТочкиРаздачи.НайтиПоКоду("100"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	
	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДокументыСОшибками = новый Массив;	
	Пока ВыборкаСсылка.Следующий() Цикл
		// Вставить обработку выборки ВыборкаСсылка
		
		Приходная = ВыборкаСсылка.Ссылка;
		
		ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();
		
		нз = РегистрыНакопления.Расход.СоздатьНаборЗаписей();
		нз.Отбор.Регистратор.Значение = Приходная;
		
		нз.Записывать = Истина;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтрокаНЗ =  нз.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНЗ,ВыборкаДетальныеЗаписи);
		КонецЦикла;
		Попытка
		    нз.Записать();
		Исключение
			ДокументыСОшибками.Добавить(Приходная);
		КонецПопытки;
	КонецЦикла;

	Для каждого элем из ДокументыСОшибками Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(элем);
		
	КонецЦикла;
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
КонецПроцедуры	


Процедура ПереСинхронизироватьПоступления(ДатаНачала, ДатаОкончания) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеЗаказовСайт.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ДанныеЗаказовСайт КАК ДанныеЗаказовСайт
		|ГДЕ
		//|	(ТИПЗНАЧЕНИЯ(ДанныеЗаказовСайт.Заказ) = ТИП(Справочник.Посылки)
		//|				И ДанныеЗаказовСайт.АктуальнаяПерваяТочка = ЗНАЧЕНИЕ(Справочник.ТочкиРаздачи.ПустаяСсылка)
		|			 ДанныеЗаказовСайт.КоличествоВсего = 0  и
		|	 ДанныеЗаказовСайт.Регистратор.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ТИПЗНАЧЕНИЯ(ДанныеЗаказовСайт.Регистратор) = ТИП(Документ.СинхронизацияПоступлений)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеЗаказовСайт.Регистратор
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДанныеЗаказовСайт.Регистратор.Дата";
	
	Запрос.УстановитьПараметр("ДатаНачала", 	ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 	ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Синзронизация = Выборка.Регистратор.ПолучитьОбъект();
		Если Синзронизация.Данные.Количество()>0 Тогда
			Синзронизация.ВыгрузитьНаСайт();
			Синзронизация.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры
